Terraform Plan: `success`
<details><summary>Show plan</summary>

```
Acquiring state lock. This may take a few moments...
aws_db_parameter_group.main: Refreshing state... [id=simoom-stg]
aws_key_pair.bastion: Refreshing state... [id=simoom-stg-bastion]
aws_ecr_repository.api: Refreshing state... [id=simoom-stg-api]
aws_ecs_cluster.api: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:866004972147:cluster/simoom-stg-api]
aws_vpc.main: Refreshing state... [id=vpc-0c6fe8c54588a2b9a]
aws_s3_bucket.tfstate: Refreshing state... [id=simoom-stg-tf-remote-state]
aws_dynamodb_table.tfstate_lock: Refreshing state... [id=simoom-stg-tfstate-lock]
aws_iam_role.ecs_api_execution: Refreshing state... [id=simoom-stg-ecs-api-task-execution]
aws_s3_bucket.alb_api_logs: Refreshing state... [id=simoom-stg-alb-api-logs]
aws_secretsmanager_secret.api_secrets: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:866004972147:secret:simoom-stg-api-secrets-VoxtBg]
data.aws_secretsmanager_secret_version.api_secrets: Reading...
aws_iam_role_policy.ecs_api_execution: Refreshing state... [id=simoom-stg-ecs-api-task-execution:simoom-stg-ecs-api-execution]
data.aws_secretsmanager_secret_version.api_secrets: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-1:866004972147:secret:simoom-stg-api-secrets-VoxtBg|AWSCURRENT]
aws_ecs_task_definition.api: Refreshing state... [id=simoom-stg-api]
aws_internet_gateway.main: Refreshing state... [id=igw-00199c85440de1875]
aws_security_group.bastion: Refreshing state... [id=sg-00bb5e880f6d91e67]
aws_subnet.private_a: Refreshing state... [id=subnet-0fb9a27e8224e6af3]
aws_subnet.private_c: Refreshing state... [id=subnet-0e930ccef6bfc1a67]
aws_subnet.public_c: Refreshing state... [id=subnet-0ee46dbe3ac7e5a43]
aws_security_group.ecs_api: Refreshing state... [id=sg-0012dcf124c1e647a]
aws_security_group.rds: Refreshing state... [id=sg-02835e38e36d0a2f1]
aws_subnet.public_a: Refreshing state... [id=subnet-0463b8651cdf4a19f]
aws_security_group.alb_api: Refreshing state... [id=sg-0f182f15cfbeff78e]
aws_route_table.public: Refreshing state... [id=rtb-04a3f7a420fb9e2f2]
aws_db_subnet_group.main: Refreshing state... [id=simoom-stg]
aws_vpc_security_group_egress_rule.bastion_egress: Refreshing state... [id=sgr-01d735a54242734f6]
aws_vpc_security_group_ingress_rule.bastion_ingress: Refreshing state... [id=sgr-0ab4ba7b5be1feb83]
aws_vpc_security_group_ingress_rule.ecs_api_ingress: Refreshing state... [id=sgr-06bdc8d7176028540]
aws_vpc_security_group_egress_rule.ecs_api_egress: Refreshing state... [id=sgr-05528148d6c850f9f]
aws_vpc_security_group_ingress_rule.alb_api_ingress: Refreshing state... [id=sgr-0d46b15b07eb2e324]
aws_instance.bastion: Refreshing state... [id=i-0970b6b5c06499d26]
aws_vpc_security_group_egress_rule.alb_api_egress: Refreshing state... [id=sgr-096cc9cd17d31482e]
aws_vpc_security_group_ingress_rule.rds_ingress: Refreshing state... [id=sgr-0e1d98dcebe497d2e]
aws_vpc_security_group_egress_rule.rds_egress: Refreshing state... [id=sgr-0da3b4e32378f1005]
aws_route_table_association.public_c: Refreshing state... [id=rtbassoc-0f7644f60a7d5b171]
aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-0fe0e5b036e5cebfe]
aws_db_instance.main: Refreshing state... [id=db-EFAMHOW3CT7PRKZ6SGUDXBFYAU]
aws_s3_bucket_versioning.tfstate: Refreshing state... [id=simoom-stg-tf-remote-state]
aws_s3_bucket_policy.lb_api_logs: Refreshing state... [id=simoom-stg-alb-api-logs]
aws_eip.bastion: Refreshing state... [id=eipalloc-074885772f1b8fbee]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:866004972147:cluster/simoom-stg-api"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "simoom-stg-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:866004972147:task-definition/simoom-stg-api:8"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "simoom-api"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0012dcf124c1e647a",
            ]
          + subnets          = [
              + "subnet-0e930ccef6bfc1a67",
              + "subnet-0fb9a27e8224e6af3",
            ]
        }
    }

  # aws_eip.nat_a will be created
  + resource "aws_eip" "nat_a" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "simoom-stg-nat-a"
        }
      + tags_all             = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Name"      = "simoom-stg-nat-a"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }
      + vpc                  = (known after apply)
    }

  # aws_lb.api will be created
  + resource "aws_lb" "api" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "simoom-stg-api-public"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0f182f15cfbeff78e",
        ]
      + subnets                                                      = [
          + "subnet-0463b8651cdf4a19f",
          + "subnet-0ee46dbe3ac7e5a43",
        ]
      + tags_all                                                     = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "simoom-stg-alb-api-logs"
          + enabled = true
        }
    }

  # aws_lb_listener.api_http will be created
  + resource "aws_lb_listener" "api_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "404 Not Found"
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.api will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.api will be created
  + resource "aws_lb_target_group" "api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "simoom-stg-api-public"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0c6fe8c54588a2b9a"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/simoompb.v1.SimoomService/CheckHealth?encoding=json&message=%7b%7d"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_nat_gateway.a will be created
  + resource "aws_nat_gateway" "a" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0463b8651cdf4a19f"
      + tags                               = {
          + "Name" = "simoom-stg-a"
        }
      + tags_all                           = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Name"      = "simoom-stg-a"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }
    }

  # aws_route_table.private_a will be created
  + resource "aws_route_table" "private_a" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/16"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "simoom-stg-private-a"
        }
      + tags_all         = {
          + "Env"       = "stg"
          + "ManagedBy" = "terraform"
          + "Name"      = "simoom-stg-private-a"
          + "Owner"     = "minguu42"
          + "Product"   = "simoom"
        }
      + vpc_id           = "vpc-0c6fe8c54588a2b9a"
    }

  # aws_route_table_association.private_a will be created
  + resource "aws_route_table_association" "private_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0fb9a27e8224e6af3"
    }

  # aws_route_table_association.private_c will be created
  + resource "aws_route_table_association" "private_c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0e930ccef6bfc1a67"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>